; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v12 ?v7)
             (pred_1 ?v13 ?v11)
             (pred_10 ?v12 ?v11)
             (pred_4 ?v3 ?v12 )
	     (pred_6 ?v12)
             (pred_8 ?v1)
             (pred_9 ?v13)
             (pred_7 ?v11)
             (pred_12 ?v12)
             (pred_2 ?v13)
             (pred_5 ?v12)
             (pred_11 ))



(:action op_2
:parameters (?v4 ?v8 ?v2 ?v10)
:precondition (and (pred_8 ?v4) (pred_8 ?v8) (pred_9 ?v2) (pred_7 ?v10)
          (pred_3 ?v4 ?v8) (pred_1 ?v2 ?v10)
                   (pred_10 ?v8 ?v10) (pred_6 ?v4) 
                   (pred_12 ?v8) (pred_2 ?v2))
:effect (and  (pred_5 ?v8) (not (pred_12 ?v8))))


(:action op_1
:parameters (?v4 ?v5)
:precondition (and (pred_8 ?v4) (pred_8 ?v5)
               (pred_6 ?v4) (pred_3 ?v4 ?v5) (pred_5 ?v5))
:effect (and (pred_6 ?v5) (not (pred_6 ?v4))))

(:action op_3
:parameters (?v4 ?v2)
:precondition (and (pred_8 ?v4) (pred_9 ?v2) 
                  (pred_6 ?v4) (pred_4 ?v2 ?v4) (pred_11 ))
:effect (and (pred_2 ?v2)
   (not (pred_4 ?v2 ?v4)) (not (pred_11 ))))


(:action op_5
:parameters (?v4 ?v6 ?v9)
:precondition (and (pred_8 ?v4) (pred_9 ?v6) (pred_9 ?v9)
                  (pred_6 ?v4) (pred_2 ?v9) (pred_4 ?v6 ?v4))
:effect (and (pred_2 ?v6) (pred_4 ?v9 ?v4)
        (not (pred_2 ?v9)) (not (pred_4 ?v6 ?v4))))

(:action op_4
:parameters (?v4 ?v2)
:precondition (and (pred_8 ?v4) (pred_9 ?v2) 
                  (pred_6 ?v4) (pred_2 ?v2))
:effect (and (pred_11 ) (pred_4 ?v2 ?v4) (not (pred_2 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_10 obj_14 obj_06 obj_15 obj_11 obj_20 obj_18 obj_01 obj_08 obj_13 obj_07 obj_05 obj_21 obj_03 obj_16
    obj_12 obj_04
    obj_19 obj_09 obj_17
    )

    (:init
       (pred_11)

       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_06)
       (pred_8 obj_15)
       (pred_8 obj_11)
       (pred_8 obj_20)
       (pred_8 obj_18)
       (pred_8 obj_01)
       (pred_8 obj_08)
       (pred_8 obj_13)
       (pred_8 obj_07)
       (pred_8 obj_05)
       (pred_8 obj_21)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_7 obj_12)
       (pred_7 obj_04)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_17)

       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_14 obj_20)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_14)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_11)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_11 obj_20)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_20 obj_14)
       (pred_3 obj_20 obj_11)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_01 obj_08)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_01)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_13 obj_08)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_05 obj_21)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_05)
       (pred_3 obj_03 obj_16)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_16 obj_03)
       (pred_12 obj_13)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_10  obj_13 obj_12)
       (pred_10  obj_16 obj_04)
       (pred_10  obj_06 obj_12)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_14)
       (pred_5 obj_15)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_03)

       (pred_1  obj_19 obj_12)
       (pred_1  obj_09 obj_04)
       (pred_1  obj_17 obj_04)
       (pred_4 obj_19 obj_21)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_17 obj_11)
       (pred_6 obj_07)
    )

    (:goal (and
       (pred_4 obj_09 obj_03)
    ))
(:constraints
  (always (not (pred_6 obj_08)))
)
)

; plan
1. (op_1 obj_07 obj_18)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_18)
   goals met: 0 of 1
2. (op_1 obj_18 obj_20)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_20)
   goals met: 0 of 1
3. (op_3 obj_20 obj_09)
   deleted: (pred_4 obj_09 obj_20) (pred_11)
   added: (pred_2 obj_09)
   goals met: 0 of 1
4. (op_1 obj_20 obj_18)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_18)
   goals met: 0 of 1
5. (op_1 obj_18 obj_07)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_07)
   goals met: 0 of 1
6. (op_2 obj_07 obj_16 obj_09 obj_04)
   deleted: (pred_12 obj_16)
   added: (pred_5 obj_16)
   goals met: 0 of 1
7. (op_1 obj_07 obj_16)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_16)
   goals met: 0 of 1
8. (op_1 obj_16 obj_03)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_03)
   goals met: 0 of 1
9. (op_4 obj_03 obj_09)
   deleted: (pred_2 obj_09)
   added: (pred_11) (pred_4 obj_09 obj_03)
   goals met: 1 of 1
